// 1) Використовуючи оператор "Рівності (==)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let a = 1;
let b = 3;
let c = "1";
let d = true;

a == b;
console.log (a==b);
false
a == c;
console.log (a==c);
true
a == d
console.log (a==d)
true

// 2) Використовуючи оператор "Нерівності (!=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a != c;
console.log (a != c);
false
c != d;
console.log (c != d);
false
b !=a;
console.log (b != a);
true

// 3) Використовуючи оператор "Строгої рівності (===)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a === c;
console.log (a === c);
false
a === 1;
console.log (a === 1);
true

// 4) Використовуючи оператор "Строгої нерівності (!==)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a !== 1
console.log (a !== 1)
false
c !== d
console.log (a !== d)
true

// 5) Використовуючи оператор "Більше ніж (>)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a > b
console.log (a > b)
false
a > null
console.log ( a > null)
true


// 6) Використовуючи оператор "Більше чи дорівнює (>=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

b >= 6
console.log (b >= 6)
false
c >= a
console.log (c >= a)
true

// 7) Використовуючи оператор "Менше ніж (<)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"
b < null
console.log (b < null)
false
a < b
console.log (a < b)
true

// 8) Використовуючи оператор "Менше чи дорівнює (<=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a <= -12
console.log (a<= -12)
false
null <= a
console.log (null <= a)
true

// 9) Використовуючи оператор "Логічне І (&&)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a == c && b == d 
console.log (a == c && b ==d)
false

a ==c && a == d
console.log (a ==c && a == d)
true

// 10) Використовуючи оператор "Логічне АБО (||)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a <= null || a >= b
console.log (a <= null || a >= b)
false
a === null || a >= 1
console.log (a === null || a >= 1)
true

// 11) Використовуючи оператор "Логічне НЕ (!)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

a = !true
console.log (a = !true)
false
c = !null
console.log (c = !null)
true

// 12) Використовуючи оператор "Рядкове додавання (+)" додайте два значення типу "string".
// * Виведіть результат в консоль за допомогою "console.log"

let x = "hello"
let y = "world"

x + ", " + y
console.log (x + ", " + y)
"hello, world"


// 13) За допомогою тернарного оператору присвойте значення у змінну "type" використовуючи змінну "color". Якщо колір дорівнює "червоний", тоді значення змінної має бути "пожежна" інакше "медична".
// * Виведіть "type" в консоль за допомогою "console.log". Зробіть два варіанти в одному резyльтат в консолі має бути "пожежна" в іншому "медична"

let color = 'червоний';
let type = (color == 'червоний') ? 'пожежна':'медична'
console.log (type)
пожежна

let color = 'жовтий';
let type = (color == 'червоний') ? 'пожежна':'медична'
console.log (type)
медична


// 14) Створіть об'єкт з довільними ключами і видаліть довільний ключ за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"

let Ukraine = {capital: "Kyiv", currency: "Hryvnia", language: "Ukrainian"};
delete Ukraine.capital
console.log (Ukraine)
{currency: "Hryvnia", language: "Ukrainian"}

// 15) Створіть масив з довільними значеннями і видаліть довільне значення за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"
 
let lang = ['ukrainian', 'german', 'norwegian', 'serbian']
delete lang [3]
console.log (lang) 
["ukrainian", "german", "norwegian", empty]

// 16) Створіть об'єкт з довільними ключами і за допомогою оператору "in" визначіть наявність ключів у об'єкті. Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"

let Ukraine = {capital: "Kyiv", currency: "Hryvnia", language: "Ukrainian"};
console.log ("currency" in Ukraine)
true
console.log ("president" in Ukraine)
false

// 16) Створіть масив з довільними значеннями і за допомогою оператору "in" визначіть наявність значення у масиві. Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"
let lang = ['ukrainian', 'german', 'norwegian', 'serbian']
console.log (2 in lang)
true
console.log (3 in lang) 
false
// #3 was deleted in task 15, now it is empty and returns 'false'
