// 1. Використовуючи цикл "while" виведіть в консоль цифри від 0 до 10;
// * Зробіть те саме за допомогою циклу "do while" i "for"

let a = 0

while (a<=10) {
    console.log ('a', a)
    ++a
}

let a = 0
do {
    console.log ('a', a)
    ++a
}
while (a<=10)

for (let a = 0; a <=10; a++) {
    console.log ('a', a)
}    

// 2. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   console.log(i);
//   ++i;
// }

//цикл не спрацює, бо в умові і більше 10. можна написати цикл через do...while, тоді отримаємо 0

do {
    console.log (i)
    ++i
} while (i>10)

// 3. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// do {
//   console.log(i);
//   ++i;
// } while (i < 10)

// останнє значення 9

// 4. Замініть цей приклад використовуючи "while"
//
// for (let i = 0; i < 10; i++) {
//   console.log('i', i);
// }

let i = 0
while (i < 10) {
    console.log ('i', i)
    i++
}

// 5. Яке перше значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   ++i;
//   console.log(i);
// }

// жодне, бо не виконується умова. якщо записати цикл через do...while то виведеться 0

let i = 0
do {
    console.log (i)
    ++i
} while (i > 10)

// 6. Яке перше значення буде виведено в консоль?
// let i = 1;
//
// do {
//   i++;
//   console.log(i);
// } while (i < 10)
    
// виведеться 2
